{"keras_version": "2.1.6", "config": [{"config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last", "batch_input_shape": [null, 2, 2, 512]}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 256, "name": "dense_1", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "activation": "sigmoid", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "units": 1, "name": "dense_2", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}