{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.6", "config": [{"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "name": "conv2d_1", "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_last", "use_bias": true, "batch_input_shape": [null, 32, 32, 3], "activity_regularizer": null, "dtype": "float32", "activation": "relu", "filters": 32}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "name": "conv2d_2", "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "valid", "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "filters": 32}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.25, "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "name": "conv2d_3", "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "filters": 64}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "name": "conv2d_4", "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "valid", "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "filters": 64}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_2", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.25, "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "units": 512, "trainable": true, "bias_regularizer": null, "name": "dense_1", "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "rate": 0.5, "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "units": 10, "trainable": true, "bias_regularizer": null, "name": "dense_2", "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}